[
    {
        "roll": [1, 1],
        "text": "Mutation without, corruption within.",
        "effect": "Roll once on the Malignancies table and apply the result."
    },
    {
        "roll": [2, 5],
        "text": "Trust in your fear.",
        "effect": "Increase Perception by 5. Gain the Phobia Mental Disorder."
    },
    {
        "roll": [6, 9],
        "text": "Humans must die so that humanity can endure.",
        "effect": "Gain the Jaded talent. If already possessed, increase Willpower by 2 instead."
    },
    {
        "roll": [10, 13],
        "text": "The pain of the bullet is ecstasy compared to damnation.",
        "effect": "Reduce Agility by 3. The first time this character suffers Critical damage each session, roll 1d10. On a result of 10, he does not suffer any Critical Effects, though the damage still counts as Critical damage."
    },
    {
        "roll": [14, 17],
        "text": "Be a boon to your allies and the bane of your enemies.",
        "effect": "Gain the Hatred (choose any one) talent. If already possessed, increase Strength by 2 instead."
    },
    {
        "roll": [18, 21],
        "text": "The wise learn from the deaths of others.",
        "effect": "Increase Agility or Intelligence by 3. Reduce Weapon Skill or Ballistic Skill by 3."
    },
    {
        "roll": [22, 25],
        "text": "Kill the alien before it can speak its lies.",
        "effect": "Gain the Quick Draw talent. If already possessed, increase Agility by 2 instead."
    },
    {
        "roll": [26, 29],
        "text": "Truth is subjective.",
        "effect": "Increase Perception by 3. The first time this character would gain 1 or more Corruption points each session, he gains that amount plus 1 instead."
    },
    {
        "roll": [30, 33],
        "text": "Thought begets Heresy.",
        "effect": "Reduce Intelligence by 3. The first time this character would gain 1 or more Corruption points each session, he reduces that amount by 1 (to a minimum of 0) instead."
    },
    {
        "roll": [34, 38],
        "text": "Heresy begets Retribution.",
        "effect": "Increase Fellowship or Strength by 3. Reduce Toughness or Willpower by 3."
    },
    {
        "roll": [39, 43],
        "text": "A mind without purpose wanders in dark places.",
        "effect": "When gaining Mental Disorders, the character may choose to gain a new Disorder instead of increasing the severity of an existing Disorder."
    },
    {
        "roll": [44, 49],
        "text": "If a job is worth doing, it is worth dying for.",
        "effect": "Increase Toughness or Willpower by 3. Reduce Fellowship or Strength by 3."
    },
    {
        "roll": [50, 54],
        "text": "Dark dreams lie upon the heart.",
        "effect": "Whenever this character would roll on the Malignancies table, he may instead select any one result and gain that Malignancy."
    },
    {
        "roll": [55, 59],
        "text": "Violence solves everything.",
        "effect": "Increase Weapon Skill or Ballistic Skill by 3. Reduce Agility or Intelligence by 3."
    },
    {
        "roll": [60, 63],
        "text": "Ignorance is a wisdom of its own.",
        "effect": "Reduce Perception by 3. The first time this character would gain 1 or more Insanity points each session, he reduces that amount by 1 (to a minimum of 0) instead."
    },
    {
        "roll": [64, 67],
        "text": "Only the insane have strength enough to prosper.",
        "effect": "Increase Willpower by 3. The first time this character would gain 1 or more Insanity points each session, he gains that amount plus 1 instead."
    },
    {
        "roll": [68, 71],
        "text": "A suspicious mind is a healthy mind.",
        "effect": "Increase Perception by 2. Additionally, the character may re-roll Awareness tests to avoid being Surprised."
    },
    {
        "roll": [72, 75],
        "text": "Suffering is an unrelenting instructor.",
        "effect": "Reduce Toughness by 3. The first time this character suffers any damage each session, he gains a +20 bonus to the next test he makes before the end of his next turn."
    },
    {
        "roll": [76, 79],
        "text": "The only true fear is dying without your duty done.",
        "effect": "Gain the Resistance (Cold, Heat, or Fear) talent. If already possessed, increase Toughness by 2 instead."
    },
    {
        "roll": [80, 83],
        "text": "Only in death does duty end.",
        "effect": "The first time this character would suffer Fatigue each session, he suffers that amount of Fatigue minus 1 (to a minimum of 0) instead."
    },
    {
        "roll": [84, 87],
        "text": "Innocence is an illusion.",
        "effect": "Gain the Keen Intuition talent. If already possessed, increase Intelligence by 2 instead."
    },
    {
        "roll": [88, 91],
        "text": "To war is human.",
        "effect": "Gain the Dodge skill as a Known skill (rank 1). If already possessed, increase Agility by 2 instead."
    },
    {
        "roll": [92, 95],
        "text": "There is no substitute for zeal.",
        "effect": "Gain the Clues from the Crowds talent. If already possessed, increase Fellowship by 2 instead."
    },
    {
        "roll": [96, 99],
        "text": "Even one who has nothing can still offer his life.",
        "effect": "When this character burns Fate threshold to survive a lethal injury, roll 1d10. On a result of 10, he survives whatever grievous wound would have killed him but does not reduce his Fate threshold."
    },
    {
        "roll": [100, 100],
        "text": "Do not ask why you serve. Only ask how.",
        "effect": "Increase Fate threshold by 1."
    }
]
