[
    {
        "name": "Investigate Lans Guljian",
        "type": "objective",
        "img": "systems/dh2e/icons/default-icons/objective.svg",
        "system": {
            "description": "<p>A lesser noble of Hive Desoleum has been struck by sudden and violent madness. Your Inquisitor suspects the hand of the archenemy.</p><ul><li>Travel to <strong>Hesentanz Manor</strong> in the Apex and gain entry to the Guljian estate.</li><li>Examine the circumstances of <strong>Lans Guljian's</strong> descent into insanity.</li><li>Locate and recover the <strong>black orb</strong>&mdash;a xenos artefact believed to be the source of his affliction.</li><li>Identify the supplier who delivered the artefact to the Guljian household and follow any leads.</li></ul>",
            "source": "core-rulebook",
            "status": "active",
            "assignedBy": "",
            "timestamp": 0,
            "completedTimestamp": 0,
            "scope": "warband",
            "format": "parchment"
        }
    },
    {
        "name": "Find Zax Holthane",
        "type": "objective",
        "img": "systems/dh2e/icons/default-icons/objective.svg",
        "system": {
            "description": "<p>The trail of proscribed xenos artefacts leads from the Apex down into the underhive. A network of smugglers and criminals must be unravelled.</p><ul><li>Make contact with the <strong>Babyfaces gang</strong> at the <strong>Screaming Wheel</strong> cantina to trace the supply chain.</li><li>Follow the trail to the Sable Trader <strong>Zax Holthane</strong>, operating from <strong>Three Stakes' Rest</strong>.</li><li>Capture or interrogate Holthane to learn the source of the smuggled goods and the details of incoming shipments.</li></ul>",
            "source": "core-rulebook",
            "status": "active",
            "assignedBy": "",
            "timestamp": 0,
            "completedTimestamp": 0,
            "scope": "warband",
            "format": "parchment"
        }
    },
    {
        "name": "Investigate Port Gyre",
        "type": "objective",
        "img": "systems/dh2e/icons/default-icons/objective.svg",
        "system": {
            "description": "<p>Corruption has taken root within the port authority of Hive Desoleum. Shuttle landing records have been doctored to conceal incoming smuggler vessels.</p><ul><li>Proceed to <strong>Port Gyre</strong> and investigate irregularities in the docking manifests.</li><li>Identify the official responsible for falsifying records&mdash;suspected to be <strong>Prefect Gaius Anteshern</strong>.</li><li>Determine the time and location of the next incoming smuggler's shuttle.</li></ul>",
            "source": "core-rulebook",
            "status": "active",
            "assignedBy": "",
            "timestamp": 0,
            "completedTimestamp": 0,
            "scope": "warband",
            "format": "parchment"
        }
    },
    {
        "name": "Intercept the Shipment",
        "type": "objective",
        "img": "systems/dh2e/icons/default-icons/objective.svg",
        "system": {
            "description": "<p>A smuggler's lighter carrying proscribed cargo is inbound. This shipment must not reach its intended recipient.</p><ul><li>Intercept <strong>Arvus Lighter 341 Beta-Sky</strong> at <strong>Landing Platform Tertius-9</strong>.</li><li>Prevent delivery of the cargo to the arch-heretek <strong>Somnius Halbrel</strong>&mdash;by force, boarding, or covert observation.</li><li>Recover or destroy all xenos artefacts aboard the vessel.</li></ul>",
            "source": "core-rulebook",
            "status": "active",
            "assignedBy": "",
            "timestamp": 0,
            "completedTimestamp": 0,
            "scope": "warband",
            "format": "parchment"
        }
    },
    {
        "name": "Hunt the Daemonhost",
        "type": "objective",
        "img": "systems/dh2e/icons/default-icons/objective.svg",
        "system": {
            "description": "<p>The Daemonhost <strong>Suvfaeras</strong> has broken free of its bindings and fled into the tunnels beneath Port Gyre. Every moment it remains at large, it grows stronger.</p><ul><li>Track the Daemonhost through the <strong>Underport</strong> before it regains full strength.</li><li>Contend with the arch-heretek <strong>Halbrel's</strong> forces, who pursue the entity for their own vile purposes.</li><li>Destroy or banish the Daemonhost at all costs. Failure is not an option.</li></ul>",
            "source": "core-rulebook",
            "status": "active",
            "assignedBy": "",
            "timestamp": 0,
            "completedTimestamp": 0,
            "scope": "warband",
            "format": "parchment"
        }
    },
    {
        "name": "Black Orb",
        "type": "gear",
        "img": "systems/dh2e/icons/items/gear.svg",
        "system": {
            "description": "<p>A perfectly smooth black orb, heavy and cold to the touch, about the size of a clenched fist. It never rolls&mdash;when placed on a slanted surface, it slides, but its orientation never changes. Of clearly xenos origin and potentially millions of years old.</p><p>After carrying the orb for a few hours, the bearer experiences visions of a vast and barren alien landscape, studded with massive and bizarre structures. This requires a <strong>Fear (1)</strong> test. Visions repeat at irregular intervals and continue as long as the bearer is in proximity to the orb. A psyker can sense the stink of the Warp on a <strong>Routine (+20) Psyniscience</strong> test.</p><p>The orb is extremely dangerous and should be recovered for the Inquisitor.</p>",
            "weight": 1,
            "quantity": 1,
            "craftsmanship": "common",
            "source": "core-rulebook"
        }
    },
    {
        "name": "Mummified Alien Hand",
        "type": "gear",
        "img": "systems/dh2e/icons/items/gear.svg",
        "system": {
            "description": "<p>A small box of black metal containing what appears to be the mummified hand of an alien creature, with three clawed fingers. Found hidden beneath a floor grate in Holthane's manufactorum.</p><p>The hand is of no obvious function but is clearly of xenos origin, linking Holthane to the Trade Sable. If brought within half a metre of the black orb from Guljian's study, the hand twitches slightly.</p><p>The hand should be recovered and turned over to the Inquisitor for examination.</p>",
            "weight": 0.5,
            "quantity": 1,
            "craftsmanship": "common",
            "source": "core-rulebook"
        }
    }
]
