[
    {
        "name": "Fanatic",
        "description": "The Imperium thrives on belief. Belief drives the Adeptus Ministorum in its efforts to unite Mankind in worship of the Emperor. For most citizens, belief might be as simple as the forlorn idea that tomorrow might be a better day, or that they can expect a tomorrow at all. For a Fanatic, though, belief is all. It consumes his life, and the depth of his conviction creates the purity of utter certainty in his actions and utter obsessiveness towards his goals. He might easily hate anyone not agreeing with him as much as he hates the target of his beliefs, and burn friend as well as foe in his quest. Death holds no fear, and any setbacks only make him redouble his efforts. Convinced in the righteousness of his beliefs, no matter what they are, he strides fearlessly against his foes as an unstoppable force, and woe unto anyone or anything that dares bar his way.",
        "bonus": "Death to All Who Oppose Me!",
        "bonusDescription": "In addition to the normal uses of Fate points, a Fanatic character may spend a Fate point to count as having the Hatred talent against his current foe for the duration of the encounter. Should he choose to leave combat against a Hated foe in that encounter, however, he gains 1 Insanity point.",
        "source": "enemies-within",
        "rules": [
            { "key": "GrantAptitude", "aptitude": "Leadership" },
            { "key": "GrantAptitude", "aptitude": "Offence" },
            { "key": "GrantAptitude", "aptitude": "Toughness" },
            { "key": "GrantAptitude", "aptitude": "Weapon Skill" },
            { "key": "GrantAptitude", "aptitude": "Willpower" },
            { "key": "Grant", "type": "talent", "options": ["Deny the Witch", "Jaded"] },
            { "key": "FateOption", "slug": "death-to-all-who-oppose-me", "label": "Death to All Who Oppose Me!", "description": "Gain Hatred against current foe for this encounter", "effectType": "gainHatred" }
        ]
    },
    {
        "name": "Penitent",
        "description": "Most heretics end their deluded lives burnt on righteous pyres, devoured by Daemons, or torn apart by loyal citizens, but for a small portion there are fates perhaps worse. A Penitent must continue living, both knowing his damnable transgressions against his fellow humans and denying himself cleansing death until he redeems his soul. Even this mental suffering is not enough—for many, similar punishment of the flesh is also necessary. The Penitent fully believes in his woeful state, and his sins dominate his thoughts. He knows he has erred in the eyes of the Emperor, and that is enough in his fervent desire for utter purity. The Penitent knows of his terrible sins, be they real or imagined, and devotes himself to using pain, denial, and other mortifications of the mind and body in his quest for redemption.",
        "bonus": "Cleansing Pain",
        "bonusDescription": "Whenever a Penitent character suffers 1 or more points of damage (after reductions for Toughness bonus and Armour), he gains a +10 bonus to the first test he makes before the end of his next turn.",
        "source": "enemies-within",
        "rules": [
            { "key": "GrantAptitude", "aptitude": "Agility" },
            { "key": "GrantAptitude", "aptitude": "Fieldcraft" },
            { "key": "GrantAptitude", "aptitude": "Intelligence" },
            { "key": "GrantAptitude", "aptitude": "Offence" },
            { "key": "GrantAptitude", "aptitude": "Toughness" },
            { "key": "Grant", "type": "talent", "options": ["Die Hard", "Flagellant"] }
        ]
    }
]
