[
    {
        "name": "DH2E System Guide",
        "img": "icons/svg/book.svg",
        "pages": [
            {
                "name": "Getting Started",
                "type": "text",
                "text": {
                    "content": "<h2>Welcome to Dark Heresy 2nd Edition</h2><p>This system automates the core rules of the DH2E tabletop RPG within Foundry VTT. Combat rolls, armour, damage, psychic phenomena, corruption, insanity, and more are handled for you — but the GM always has override capability.</p><h3>First Steps for the GM</h3><ol><li><strong>Enable the Data Module</strong> — Go to <em>Add-on Modules</em> and activate <code>DH2E - Core Rulebook Data</code>. This loads skills, talents, weapons, armour, NPCs, and character creation data.</li><li><strong>Check Settings</strong> — Open <em>Configure Settings → DH2E</em>. Settings are grouped into Automation, Combat, Display, and Loot. See the <em>Settings Reference</em> page for full details. The defaults match RAW (Rules As Written).</li><li><strong>Create a Warband</strong> — The system auto-creates a warband on first launch. Open it with the <strong>W</strong> key. Add players as members, set an Inquisitor, and manage shared inventory here.</li><li><strong>Run Character Creation</strong> — Players create an Acolyte actor, then click the <em>Character Creation</em> button on their sheet. The guided wizard walks through Homeworld → Background → Role → Divination → Characteristics → Advancement.</li></ol><h3>First Steps for Players</h3><ol><li><strong>Create Your Character</strong> — The GM will guide you. Create an Acolyte, then use the creation wizard. You'll pick your homeworld, background, and role, roll the Emperor's Divination, generate characteristics, and spend starting XP.</li><li><strong>Learn the Keyboard Shortcuts</strong> — <kbd>Ctrl+Space</kbd> opens Quick Search (find any item instantly). <kbd>Ctrl+B</kbd> opens the Compendium Browser. <kbd>Shift+A</kbd> opens the Actions Grid.</li><li><strong>Favourites</strong> — Click the star icon next to any weapon, skill, or item to favourite it. Favourited items appear in your Combat HUD hotbar for one-click access during encounters.</li></ol><h3>Key Concepts</h3><ul><li><strong>d100 Roll-Under</strong> — Roll d100; succeed if the result is ≤ your target number (characteristic + modifiers, capped at ±60).</li><li><strong>Degrees of Success (DoS)</strong> — Measures how well you succeed: <code>1 + floor(target/10) - floor(roll/10)</code>. More DoS = better outcome (extra hits in combat, better loot finds, etc.).</li><li><strong>Rule Elements</strong> — Weapons, talents, and traits use declarative rules (YAML) that automatically apply modifiers, dice overrides, and conditions. GMs can edit these for custom items.</li></ul>",
                    "format": 1
                },
                "sort": 100000
            },
            {
                "name": "Character Creation",
                "type": "text",
                "text": {
                    "content": "<h2>Character Creation Wizard</h2><p>The creation wizard is a 6–7 step guided process. To start: create an Acolyte actor, open the sheet, and click the <strong>Character Creation</strong> button.</p><h3>Step 1: Homeworld</h3><p>Choose from 6 homeworlds. Each grants:</p><ul><li><strong>Characteristic Bonuses</strong> — One or two stats get +5, one or two get -5.</li><li><strong>Fate Threshold &amp; Blessing</strong> — Determines starting (and max) Fate points.</li><li><strong>Wounds</strong> — Either a flat value or a rollable formula (e.g., 9+1d5). You can reroll wounds based on the <em>Wounds Rerolls</em> setting (default: 1).</li><li><strong>Aptitude</strong> — One aptitude (affects advancement costs later).</li><li><strong>Bonus Ability</strong> — A unique homeworld perk.</li></ul><table><thead><tr><th>Homeworld</th><th>Bonuses</th><th>Penalties</th><th>Fate</th><th>Aptitude</th></tr></thead><tbody><tr><td>Feral World</td><td>+S, +T</td><td>-Inf</td><td>2/3</td><td>Toughness</td></tr><tr><td>Forge World</td><td>+Int</td><td>-Fel</td><td>3/3</td><td>Intelligence</td></tr><tr><td>Highborn</td><td>+Fel</td><td>-T</td><td>4/4</td><td>Fellowship</td></tr><tr><td>Hive World</td><td>+Ag</td><td>-WP</td><td>2/3</td><td>Perception</td></tr><tr><td>Shrine World</td><td>+WP</td><td>-Per</td><td>3/4</td><td>Willpower</td></tr><tr><td>Voidborn</td><td>+WP</td><td>-S</td><td>3/4</td><td>Intelligence</td></tr></tbody></table><h3>Step 2: Background</h3><p>Choose from 7 backgrounds. Each grants starting skills, a talent, equipment (sometimes with \"or\" choices), an aptitude, and a bonus ability. Equipment choices appear as radio buttons when you expand the background detail.</p><p><strong>Special:</strong> <em>Adeptus Astra Telepathica</em> grants the \"Sanctioned\" trait if the character later takes the Psyker elite advance — meaning no unsanctioned corruption.</p><h3>Step 3: Role</h3><p>Choose from 8 roles. Each grants 5 aptitudes (which stack with your homeworld and background aptitudes), a talent, and a bonus ability.</p><p><strong>Special:</strong> The <em>Mystic</em> role grants the Psyker elite advance automatically. If the character's background is NOT Adeptus Astra Telepathica, they gain 1d10+3 Corruption Points as an unsanctioned psyker.</p><h3>Step 4: Emperor's Divination</h3><p>Roll 1d100 on the Divinations table to receive a prophetic blessing. Effects include characteristic adjustments (+/-3 or +/-5), bonus talents, skills, or +1 Fate point. The number of rerolls is configurable (default: 0 — RAW says you keep what you get).</p><h3>Step 5: Characteristics</h3><p>Generate your 9 characteristics (WS, BS, S, T, Ag, Int, Per, WP, Fel) using one of three methods set by the GM:</p><ul><li><strong>Rolled (RAW)</strong> — 2d10+20 base, modified by homeworld. Favoured stats (+5) roll 3d10 keep highest 2 + 20. Penalised stats (-5) roll 3d10 keep lowest 2 + 20. One free reroll of any single stat.</li><li><strong>Rolled 25</strong> — Same as Rolled but base is 2d10+25 (higher starting values). Common house rule for experienced campaigns.</li><li><strong>Points</strong> — 60 points to distribute. Starting values are 25 (normal), 30 (favoured), or 20 (penalised). Cap of 40 per stat.</li></ul><h3>Step 6: Starting Advancement (Optional)</h3><p>If Starting XP is above 0 (default: 1000), the wizard shows a mini advancement shop. You can spend XP on characteristic advances, skills, and talents before play begins. Costs are aptitude-aware.</p><h3>Step 7: Review &amp; Finalize</h3><p>Review all choices. On confirmation, the system applies everything to the actor: characteristics, skills, talents, equipment, fate, wounds, aptitudes, starting Throne Gelt (default 50₮), and pre-loaded ammunition for ranged weapons.</p><h3>Aptitudes Explained</h3><p>Aptitudes are tags assigned during creation (from homeworld, background, and role). They reduce XP costs when advancing characteristics, skills, and talents. Each advance has 2 associated aptitudes; matching 0, 1, or 2 of them determines the cost tier. More matches = cheaper advancement.</p>",
                    "format": 1
                },
                "sort": 200000
            },
            {
                "name": "Combat System",
                "type": "text",
                "text": {
                    "content": "<h2>Combat System</h2><p>The DH2E system fully automates d100 roll-under combat with hit location, fire modes, degrees of success, armour, penetration, and critical injuries.</p><h3>Making an Attack</h3><ol><li><strong>Click a weapon</strong> in your Combat HUD weapon tray or on your sheet.</li><li><strong>Choose fire mode</strong> — Single (S), Semi-Auto (semi), or Full-Auto (full). Buttons appear next to the weapon.</li><li><strong>Roll dialog</strong> appears (or skip with Shift+click if configured). Shows target number, modifiers, and any situational adjustments.</li><li><strong>Roll resolves</strong> — d100 vs target number. The system calculates DoS/DoF, hit count, and hit locations automatically.</li></ol><h3>Fire Modes</h3><table><thead><tr><th>Mode</th><th>Ammo Cost</th><th>Hits on Success</th><th>Notes</th></tr></thead><tbody><tr><td>Single</td><td>1 round</td><td>1</td><td>Allows called shots (-20, pick location)</td></tr><tr><td>Semi-Auto</td><td>RoF rounds</td><td>1 + floor(DoS/2), capped at RoF</td><td>Burst fire</td></tr><tr><td>Full-Auto</td><td>RoF rounds</td><td>1 + DoS, capped at RoF</td><td>Spray &amp; pray</td></tr><tr><td>Suppressive</td><td>Full magazine</td><td>1d5 per target in zone</td><td>Empties clip, pinning test for targets</td></tr></tbody></table><h3>Hit Location</h3><p>The first hit's location is determined by <strong>reversing the d100 digits</strong>. Roll 34 → reversed to 43 → Body. Additional hits roll fresh d100s reversed.</p><table><thead><tr><th>Reversed Roll</th><th>Location</th></tr></thead><tbody><tr><td>01–10</td><td>Head</td></tr><tr><td>11–20</td><td>Right Arm</td></tr><tr><td>21–30</td><td>Left Arm</td></tr><tr><td>31–70</td><td>Body</td></tr><tr><td>71–85</td><td>Right Leg</td></tr><tr><td>86–00</td><td>Left Leg</td></tr></tbody></table><h3>Damage Resolution</h3><p>When you click <strong>[Roll Damage]</strong> on an attack card:</p><ol><li>System rolls damage dice per hit (e.g., 1d10+3)</li><li>Applies weapon qualities (Tearing rerolls lowest die, Proven(N) sets minimum, etc.)</li><li>Subtracts <strong>Effective AP</strong> = Location Armour - Weapon Penetration (min 0)</li><li>Subtracts <strong>Toughness Bonus</strong> (TB = Toughness ÷ 10)</li><li>Remaining = Wounds Dealt (min 0)</li></ol><p>Click <strong>[Apply Damage]</strong> on the damage card to deduct wounds from the target.</p><h3>Critical Injuries</h3><p>When wounds exceed the target's remaining health, excess damage triggers a critical injury. The system looks up <strong>damage type × hit location × severity</strong> on the critical tables and automatically creates a Critical Injury item on the target with all mechanical effects applied.</p><h3>Weapon Qualities</h3><p>Qualities like Accurate, Tearing, Proven, Felling, Blast, Flame, Toxic, and many more are implemented as auto-generated Rule Elements. They inject modifiers, dice overrides, and conditions at attack time without manual intervention.</p><h3>Fate Points in Combat</h3><p>Right-click any attack or damage chat card to access Fate options:</p><ul><li><strong>Spend (1 current Fate):</strong> Reroll a failed test, add +10 before rolling, or halve wounds received.</li><li><strong>Burn (1 permanent Fate):</strong> Survive certain death or auto-pass a test (1 DoS).</li></ul><h3>Action Economy</h3><p>Each combatant gets per round: 1 Half Action <em>or</em> 1 Full Action, plus 1 Free Action and 1 Reaction. The Combat HUD tracks this automatically. Actions reset on turn end.</p><h3>Suppressive Fire</h3><p>Full-auto weapons can suppress a 30° kill zone. All targets must pass a <strong>Willpower test</strong> or become Pinned. Targets acting in the zone take 1d5 automatic hits. Empties the entire magazine.</p>",
                    "format": 1
                },
                "sort": 300000
            },
            {
                "name": "Combat HUD",
                "type": "text",
                "text": {
                    "content": "<h2>Combat HUD</h2><p>The built-in Combat HUD is an Argon-style panel that appears at the bottom of the screen during encounters. It provides one-click access to weapons, skills, and actions without opening your full character sheet.</p><h3>HUD Layout</h3><ul><li><strong>Portrait &amp; Vitals</strong> — Your character portrait, current Wounds (with colour bar), and Fate points.</li><li><strong>Characteristic Grid</strong> — Quick reference for your core stats.</li><li><strong>Action Economy</strong> — Shows available actions for the current round (Half, Full, Free, Reaction). Icons dim as actions are spent.</li><li><strong>Hotbar (10 Slots)</strong> — Auto-populated with your favourited skill uses and equipped weapons. Click to use instantly.</li><li><strong>Condition Strip</strong> — Active status effects shown as icons at the bottom.</li></ul><h3>Weapon Tray</h3><p>Pop open the weapons panel to see all equipped weapons. Each weapon card shows:</p><ul><li><strong>Fire mode buttons</strong> — S (single), semi, full. Greyed out if insufficient ammo.</li><li><strong>Ammo counter</strong> — Colour-coded: green (&gt;50%), orange (&gt;25%), red (≤25% or empty).</li><li><strong>Reload button</strong> — Click to reload from compatible ammunition in your inventory. If you carry multiple ammo types, an ammo picker dialog appears.</li></ul><h3>Favourites &amp; Hotbar</h3><p>To customise your hotbar:</p><ol><li>Open your character sheet.</li><li>Click the <strong>star icon</strong> next to any weapon, skill use, or item.</li><li>Favourited items automatically fill your Combat HUD hotbar slots.</li></ol><p>You can also drag items from the hotbar to the Foundry macro bar to create quick-access macros.</p><h3>Settings</h3><ul><li><strong>Enable Combat HUD</strong> — Toggle on/off per client (default: on).</li><li><strong>HUD Position</strong> — Bottom-left or bottom-centre.</li></ul>",
                    "format": 1
                },
                "sort": 400000
            },
            {
                "name": "Ammunition & Reloading",
                "type": "text",
                "text": {
                    "content": "<h2>Ammunition &amp; Reloading</h2><p>The system uses a <strong>magazine-based</strong> ammunition model. Most weapons use detachable magazines (box mags, power packs, bolt canisters, plasma flasks) that swap as a unit. A few weapons (revolvers, shotguns, grenade launchers) load individual rounds.</p><p><em>Creative License Note:</em> The Core Rulebook uses the generic term \"clip\" for all weapons. This system interprets that as detachable magazines/power packs/canisters for most weapons, which better represents the physical reload action (swap out the whole magazine in one Full Action). This is a house-rule interpretation for gameplay clarity.</p><h3>How Magazines Work</h3><ul><li>Each ranged weapon has a <strong>Magazine</strong> value (current rounds) and <strong>Magazine Max</strong> (capacity).</li><li>Weapons have a <strong>Load Type</strong>: &quot;Magazine Swap&quot; or &quot;Individual Loading&quot;.</li><li>Firing consumes ammo based on fire mode: Single = 1 round, Semi-Auto = RoF rounds, Full-Auto = RoF rounds, Suppressive = entire magazine.</li><li>The weapon tray shows your magazine status with colour coding.</li></ul><h3>Magazine Swap Weapons</h3><p>Most weapons (autoguns, las weapons, bolt weapons, flamers, meltas, plasma) use detachable magazines:</p><ol><li>Click the <strong>reload icon</strong> to open the Magazine Picker.</li><li>Select a loaded magazine from your inventory (shows fill level and ammo type).</li><li>The old magazine is <strong>ejected to inventory</strong> (with remaining rounds intact).</li><li>The new magazine is inserted and the weapon is ready to fire.</li></ol><h3>Individual Loading Weapons</h3><p>Revolvers, hand cannons, shotguns, grenade launchers, and missile launchers load rounds one at a time:</p><ol><li>Click reload to load from loose ammo in inventory.</li><li>Rounds are added up to magazine max.</li></ol><h3>Mixed Ammunition</h3><p>Magazines can hold <strong>mixed ammo types</strong> (e.g., alternating solid rounds and man-stopper rounds). When firing, rounds are consumed in <strong>LIFO order</strong> (last loaded, first fired). For mixed loads, the system alternates between types. Each hit in a burst tracks which ammo type was used for damage calculation.</p><h3>Loading Magazines</h3><p>To load a magazine from loose ammo, click the <strong>load button</strong> on a magazine item in the Equipment tab. A dialog lets you choose ammo types and quantities. You can mix multiple types.</p><h3>Ammo Types</h3><p>Ammunition items carry modifiers that apply when loaded:</p><ul><li><strong>Damage Modifier</strong> — +/- to damage rolls.</li><li><strong>Penetration Modifier</strong> — +/- to weapon penetration.</li><li><strong>Special Qualities</strong> — Some ammo adds weapon qualities (e.g., Toxic, Tearing).</li></ul><h3>Character Creation</h3><p>During character creation, the wizard automatically pre-loads all ranged weapons to full capacity and grants <strong>2 spare pre-loaded magazines</strong> (or 3× loose rounds for individual-loading weapons).</p>",
                    "format": 1
                },
                "sort": 500000
            },
            {
                "name": "Loot & Salvage",
                "type": "text",
                "text": {
                    "content": "<h2>Loot &amp; Salvage System</h2><p>The loot system provides structured looting of defeated NPCs and searchable supply caches with DoS-gated sections.</p><h3>Killing Blow Degradation</h3><p>When an NPC is killed, their equipment may degrade based on the killing blow's precision (if the <em>Killing Blow Degradation</em> setting is enabled):</p><table><thead><tr><th>Killing DoS</th><th>Degradation Chance</th><th>Effect</th></tr></thead><tbody><tr><td>0 (bare pass)</td><td>50% per item</td><td>Craftsmanship drops 1 tier</td></tr><tr><td>1</td><td>25% per item</td><td>Craftsmanship drops 1 tier</td></tr><tr><td>2</td><td>10% per item</td><td>Craftsmanship drops 1 tier</td></tr><tr><td>3+</td><td>0%</td><td>Clean kill — equipment intact</td></tr></tbody></table><p>Craftsmanship tiers: Poor → Common → Good → Best. An item at Poor that would degrade further is <strong>destroyed</strong>. The system posts a chat message listing all degraded/destroyed items.</p><h3>Corpse Looting (Direct)</h3><p>Right-click a defeated NPC in the Actors sidebar → <strong>Loot Corpse</strong>. This opens a dialog listing all lootable items (weapons, armour, gear, ammo) with their current quality. Select items and a target (player character or warband stash) → click <strong>Loot Selected</strong> to transfer.</p><p><strong>Permissions:</strong> GM can always loot. Players can only loot if the <em>Player Looting</em> setting is enabled (default: off).</p><h3>Loot Actors (Sectioned Containers)</h3><p>For more structured looting, GMs can generate a <strong>Loot actor</strong> from a defeated NPC:</p><ol><li>Right-click defeated NPC → <strong>Generate Loot from NPC</strong> (GM only).</li><li>Creates a Loot actor with 3 sections:<ul><li><strong>DoS 0 — Carried Items</strong>: Non-equipped gear, spare ammo.</li><li><strong>DoS 1 — Equipped Gear</strong>: Weapons and armour the NPC was using.</li><li><strong>DoS 2 — Hidden Items</strong>: Empty (GM fills with bonus loot).</li></ul></li><li>Players search the Loot actor using a <strong>salvage skill check</strong> (Awareness, Scrutiny, or Inquiry).</li><li>Their DoS determines which sections they can access.</li></ol><h3>Supply Caches</h3><p>GMs can create empty supply caches via the console: <code>game.dh2e.createSupplyCache(\"Heretic Base Cache\")</code>. These come with DoS 0 (Surface Items) and DoS 2 (Hidden Compartment) sections. Drag items from the compendium into sections on the loot sheet, then let players find them.</p><h3>Salvage Checks</h3><p>When a player right-clicks a Loot actor → <strong>Search</strong>, they roll their salvage skill. The check uses the skill configured on the loot actor (default from settings). DoS determines unlocked sections. Items can be claimed individually — claimed items are marked to prevent duplicate looting across players.</p><h3>GM Controls</h3><ul><li>The Loot sheet lets you add/remove sections, adjust DoS requirements, set the salvage skill and modifier per container, and drag items from the compendium.</li><li><strong>Reset Search</strong> button allows the container to be searched again.</li><li>The <em>Auto-Reveal Surface Items</em> setting (default: on) shows DoS 0 items even on a failed check.</li></ul>",
                    "format": 1
                },
                "sort": 600000
            },
            {
                "name": "Advancement & XP",
                "type": "text",
                "text": {
                    "content": "<h2>Advancement &amp; XP Shop</h2><p>The Advancement Shop is the player-facing interface for spending XP to improve their character. Open it from the <strong>Advancement</strong> tab on the character sheet.</p><h3>What You Can Buy</h3><table><thead><tr><th>Category</th><th>Details</th></tr></thead><tbody><tr><td>Characteristics</td><td>Up to 4 advances per stat (+5 each). Cost scales by rank and aptitude match.</td></tr><tr><td>Skills</td><td>Advance owned skills or purchase new ones. 4 ranks: Known → +10 → +20 → +30.</td></tr><tr><td>Talents</td><td>Purchase from the compendium. Prerequisites checked automatically (characteristics, skills, other talents).</td></tr><tr><td>Elite Advances</td><td>Psyker, Untouchable, or Inquisitor. May require GM approval.</td></tr><tr><td>Psychic Powers</td><td>If you have Psy Rating: purchase powers at 200/300/400 XP per tier.</td></tr><tr><td>Psy Rating</td><td>Increase PR tier. Cost = 200 × next level.</td></tr></tbody></table><h3>Aptitude Matching</h3><p>Each advance has 2 associated aptitudes. Your character's aptitudes (from homeworld, background, and role) are compared:</p><ul><li><strong>2 matches</strong> — Cheapest cost tier.</li><li><strong>1 match</strong> — Middle cost tier.</li><li><strong>0 matches</strong> — Most expensive cost tier.</li></ul><p>The shop shows aptitude match pips and cost for each option. Use the <strong>Affordable Only</strong> toggle to hide options you can't afford.</p><h3>Elite Advance Approval</h3><p>When the <em>Require Elite Approval</em> setting is on (default: yes), purchasing an elite advance sends a socket-based approval request to the GM. The GM sees a prompt to approve or deny. The player's purchase is held until approved.</p><h3>XP Ledger</h3><p>Every XP transaction (earn or spend) is logged on the actor. GMs can award XP via the <strong>Award XP</strong> button (warband-wide distribution) or manually adjust individual totals if <em>Allow Player XP Edit</em> is enabled.</p><h3>XP Multiplier</h3><p>The <em>XP Multiplier</em> setting (default: 100%) scales all XP awards. 150% = faster progression, 50% = grittier campaign.</p>",
                    "format": 1
                },
                "sort": 700000
            },
            {
                "name": "Warband Management",
                "type": "text",
                "text": {
                    "content": "<h2>Warband Management</h2><p>The Warband is the party-level organisational hub. It tracks members, shared inventory, objectives, the Imperial Calendar, and pending requisitions. Press <kbd>W</kbd> to toggle the warband sheet.</p><h3>Tabs</h3><h4>Overview</h4><ul><li><strong>Member Cards</strong> — Each acolyte shown with wounds, fate points, and key stats.</li><li><strong>Characteristic Comparison</strong> — Table comparing all members, highest values highlighted.</li><li><strong>Skill Comparison</strong> — Who has what at which rank.</li><li><strong>Inquisitor</strong> — Drag an actor onto the Inquisitor drop zone to assign the team's patron.</li></ul><h4>Inventory</h4><ul><li><strong>Shared Stash</strong> — Weapons, armour, gear, ammo, and cybernetics the party carries collectively.</li><li><strong>Drag to Transfer</strong> — Drag items from the warband to a character (or vice versa) to transfer.</li><li><strong>Access Control</strong> — The <em>Warband Inventory Access</em> setting controls who can see the stash: All, Inquisitor + GM, or GM Only.</li></ul><h4>Objectives</h4><ul><li><strong>Assign Objectives</strong> — GM drags or creates objective items. Each can have a status (active/completed/failed) and a deadline.</li><li><strong>Deadline Tracking</strong> — If the Imperial Calendar is in use, deadlines count down and warn when overdue.</li></ul><h4>Chronicle</h4><ul><li><strong>Imperial Date</strong> — Tracks the current in-game date. Advance time manually or set an explicit date.</li><li><strong>Log Entries</strong> — Session summaries, events, and notes. Newest first.</li><li><strong>Deadline Notifier</strong> — Displays reminders when deadlines approach (if <em>Deadline Notifications</em> setting is on).</li></ul><h3>Requisitions</h3><p>Pending equipment requisitions are tracked on the warband. When a requisition is approved with a delivery time, it appears here with a countdown. The GM is notified when items are ready for delivery.</p>",
                    "format": 1
                },
                "sort": 800000
            },
            {
                "name": "Requisition System",
                "type": "text",
                "text": {
                    "content": "<h2>Requisition System</h2><p>Players can formally request equipment through the Requisition system, which tests their Influence against the item's Availability.</p><h3>How It Works</h3><ol><li>Open the Requisition dialog — call <code>game.dh2e.requisition()</code> or use the button on your sheet.</li><li>Select the <strong>Availability tier</strong> of the desired item (Common, Average, Scarce, Rare, Very Rare, Near Unique, Unique). Each tier has a modifier to the Influence test.</li><li>Optionally add <strong>situational modifiers</strong> (e.g., being in a hive city, contacts, etc.).</li><li>The system rolls d100 vs your <strong>Influence + availability modifier</strong>.</li><li><strong>Success</strong>: Item acquired (delivered by GM). <strong>Failure with 3+ DoF</strong>: Lose 1 permanent Influence.</li></ol><h3>GM Approval Flow</h3><p>When a player makes a requisition:</p><ol><li>A chat card posts the result (roll, DoS/DoF, Influence lost).</li><li>The GM receives an approval dialog via socket.</li><li>GM can <strong>Approve</strong> (item delivered immediately), <strong>Approve with Delay</strong> (item arrives after X time — tracked on the warband), or <strong>Deny</strong>.</li></ol><h3>Pending Requisitions</h3><p>Delayed requisitions appear on the Warband sheet with a delivery countdown. The system notifies the GM when items are ready. The GM clicks <strong>Deliver</strong> to add the item to the player's inventory.</p>",
                    "format": 1
                },
                "sort": 900000
            },
            {
                "name": "Psychic Powers",
                "type": "text",
                "text": {
                    "content": "<h2>Psychic Powers</h2><p>Psykers channel the Warp to manifest powers. The system automates focus tests, phenomena, and Perils of the Warp.</p><h3>Focus Power Test</h3><ol><li>Click a psychic power on your sheet or Combat HUD.</li><li>Choose mode: <strong>Unfettered</strong> (safe, ×5 PR bonus) or <strong>Pushed</strong> (powerful but risky, ×10 PR bonus).</li><li>System rolls d100 vs <strong>WP + (Psy Rating × multiplier) + power modifier</strong>.</li><li>Success manifests the power. Failure means the Warp resists.</li></ol><h3>Psychic Phenomena</h3><p>Phenomena trigger automatically when enabled (<em>Automate Phenomena</em> setting):</p><ul><li><strong>Unfettered mode</strong> — Phenomena on doubles (11, 22, 33, 44, etc.).</li><li><strong>Pushed mode</strong> — Phenomena <em>always</em> triggered.</li></ul><p>The system rolls 1d100 on the Psychic Phenomena table (or 1d100+25 if Pushed) and posts the result with its effects.</p><h3>Perils of the Warp</h3><p>If the Phenomena result has the <em>escalate</em> flag, it automatically escalates to a Perils of the Warp roll. Perils can cause damage, conditions, environmental effects, or worse. Results are posted to chat with all mechanical effects.</p><h3>Psy Rating Advances</h3><p>Psy Rating can be increased through the Advancement Shop. Cost = 200 × next level. Higher PR means a bigger bonus to Focus Power tests but doesn't change the phenomena trigger rules.</p>",
                    "format": 1
                },
                "sort": 1000000
            },
            {
                "name": "Vox Terminal",
                "type": "text",
                "text": {
                    "content": "<h2>Vox Terminal</h2><p>The Vox Terminal is an in-world communications system for GMs to broadcast thematic messages to players. Messages appear as CRT-style green-on-black transmissions with typewriter or decode animations.</p><h3>Sending Transmissions (GM)</h3><ol><li>Open the Vox Compose dialog — call <code>game.dh2e.voxTerminal()</code> or use the button in the GM tools.</li><li><strong>Freetext</strong>: Type a message directly. Renders with character-by-character typewriter animation.</li><li><strong>Journal Content</strong>: Click a journal entry from the picker to send its full HTML content. Renders with a decode animation preserving all formatting.</li><li>Optionally add a <strong>Sender/Designation</strong> (e.g., \"Inquisitor Hex\" or \"Sector Command\").</li><li>Choose <strong>Targets</strong>: broadcast to all players or select specific recipients.</li></ol><h3>\"Send via Vox\" Button</h3><p>When a GM has a Journal Entry open, a <strong>Send via Vox</strong> button appears in the journal header. Click it to compose a transmission from the currently viewed page — no copy-pasting needed.</p><h3>Receiving Transmissions (Players)</h3><p>Transmissions appear as an immersive CRT popup with a scanline effect and green text on a dark background. A static audio effect plays on receipt.</p><h3>Vox Log</h3><p>Each player's character stores received transmissions in a persistent Vox Log (accessible from the character sheet). The log shows entries in reverse chronological order. Content is resolved on-demand from the original journal entry, so updates to the journal are reflected.</p><p>Players can <strong>Convert to Objective</strong> from a Vox Log entry — turning mission briefings into trackable personal objectives.</p>",
                    "format": 1
                },
                "sort": 1100000
            },
            {
                "name": "Cybernetic Maintenance",
                "type": "text",
                "text": {
                    "content": "<h2>Cybernetic Maintenance</h2><p>Cybernetic implants require periodic maintenance or they degrade and eventually go offline.</p><h3>Maintenance States</h3><ul><li><strong>Normal</strong> — Fully functional. All rule elements active.</li><li><strong>Degraded</strong> — Partially functional. Some penalties may apply.</li><li><strong>Offline</strong> — Non-functional. All bonuses from the cybernetic are suppressed.</li></ul><h3>Performing Maintenance</h3><ol><li>Open the Maintenance dialog — available from the character sheet or via <code>game.dh2e.maintainCybernetics(actor)</code>.</li><li>Select which cybernetics to maintain (checkboxes).</li><li>Optionally specify a <strong>Chirurgeon</strong> (another character performing the maintenance).</li><li>Click <strong>Maintain</strong> — all selected cybernetics reset to Normal state.</li><li>A chat message summarises the maintenance with state transitions (e.g., \"Degraded → Operational\").</li></ol><h3>Maintenance Notifications</h3><p>When the <em>Deadline Notifications</em> setting is enabled and the Imperial Calendar is in use, the system tracks maintenance schedules and notifies the GM when cybernetics are due for maintenance.</p><h3>Backfill</h3><p>Existing cybernetics installed before the maintenance system was added are automatically backfilled with the current Imperial Date as their last maintenance date on game load, preventing them from showing as immediately overdue.</p>",
                    "format": 1
                },
                "sort": 1200000
            },
            {
                "name": "Homebrew Compendium",
                "type": "text",
                "text": {
                    "content": "<h2>Homebrew Compendium</h2><p>GMs can create custom items — weapons, talents, powers, gear, and more — using the Homebrew Compendium. Custom items integrate seamlessly with the compendium browser and quick search.</p><h3>How It Works</h3><p>On first login, the system automatically creates a world-level compendium called <strong>DH2E Homebrew</strong>. This pack stores all your custom items.</p><h3>Creating Homebrew Items</h3><p><strong>Method 1 — Copy &amp; Modify:</strong></p><ol><li>Open the Compendium Browser (<kbd>Ctrl+B</kbd>).</li><li>Right-click any official item → <strong>Copy to Homebrew</strong>.</li><li>The copy appears in the Homebrew pack. Open and edit freely — changes don't affect the original.</li></ol><p><strong>Method 2 — From Scratch:</strong></p><p>Use the console: <code>game.dh2e.createHomebrewItem(\"weapon\", \"Plasma Reaper\")</code></p><p>This creates a blank item of the specified type in the Homebrew pack and opens its sheet for editing.</p><h3>Visibility Control</h3><p>Each homebrew item has a <strong>public/private toggle</strong>:</p><ul><li><strong>Public (default)</strong> — Appears in searches and the browser for all users. Players see it seamlessly alongside official content — they can't tell it's homebrew.</li><li><strong>Private</strong> — Hidden from players entirely. Only the GM sees it, marked with a red \"Private (GM Only)\" badge.</li></ul><p>Toggle visibility by right-clicking a homebrew item in the browser → <strong>Toggle Visibility</strong>, or via <code>game.dh2e.homebrewPack()</code> to access the pack directly.</p><h3>GM-Only Features</h3><ul><li>The <strong>Source</strong> filter in the Compendium Browser (visible to GMs only) lets you filter by Official, Homebrew, or All.</li><li>Homebrew items show a gold <strong>Homebrew</strong> badge in search results (GM view only).</li><li>Private items show a red <strong>Private (GM Only)</strong> badge (GM view only).</li><li>Players see public homebrew items with no special indicators — fully immersive.</li></ul>",
                    "format": 1
                },
                "sort": 1300000
            },
            {
                "name": "Quick Search & Browser",
                "type": "text",
                "text": {
                    "content": "<h2>Quick Search &amp; Compendium Browser</h2><h3>Quick Search (Command Palette)</h3><p>Press <kbd>Ctrl+Space</kbd> to open the Quick Search overlay — a fast, floating search bar that appears over all Foundry UI.</p><ul><li><strong>Type to search</strong> — Results appear instantly as you type. Starts-with matches are ranked first.</li><li><strong>Keyboard navigation</strong> — Arrow keys to move selection, Enter to open the item sheet.</li><li><strong>Drag &amp; drop</strong> — Drag any result directly onto an actor sheet to add it.</li><li><strong>Escape or click backdrop</strong> — Closes the palette.</li><li><strong>Privacy-aware</strong> — Non-GM users don't see private homebrew items.</li></ul><p>Quick Search shares the same cached index as the Compendium Browser, so it's instant after the first load.</p><h3>Compendium Browser</h3><p>Press <kbd>Ctrl+B</kbd> to open the full Compendium Browser — a searchable, filterable view of all DH2E compendium content.</p><h4>Features</h4><ul><li><strong>Text Search</strong> — Search by item name.</li><li><strong>Faceted Filters</strong> — Filter by Type, Availability, Weapon Class, Damage Type, Characteristic, Discipline, and Source (GM only).</li><li><strong>Draggable Results</strong> — Drag any result to an actor sheet or the macro bar.</li><li><strong>Click to Open</strong> — Click any item name to view its full sheet.</li><li><strong>Pagination</strong> — 40 items per page with navigation.</li><li><strong>Rebuild Index</strong> — Click the refresh button to rebuild the index (useful after adding homebrew).</li></ul><h4>GM Context Menu</h4><p>GMs can right-click any result in the browser:</p><ul><li><strong>Official items</strong>: \"Copy to Homebrew\" — clones the item to your homebrew pack.</li><li><strong>Homebrew items</strong>: \"Toggle Visibility\" (public/private), \"Edit Item\" (opens sheet).</li></ul>",
                    "format": 1
                },
                "sort": 1400000
            },
            {
                "name": "Settings Reference",
                "type": "text",
                "text": {
                    "content": "<h2>Settings Reference</h2><p>All settings are in <em>Configure Settings → DH2E</em>. World-scope settings are GM-only; client-scope settings are per-player.</p><h3>Automation (World / GM Only)</h3><table><thead><tr><th>Setting</th><th>Default</th><th>RAW?</th><th>Description</th></tr></thead><tbody><tr><td>Modifier Cap</td><td>60</td><td>RAW</td><td>Maximum ± modifier on any d100 test.</td></tr><tr><td>Automate Armour</td><td>On</td><td>RAW</td><td>Auto-subtract armour from damage.</td></tr><tr><td>Automate Damage</td><td>On</td><td>RAW</td><td>Auto-calculate wound totals.</td></tr><tr><td>Fate Refresh</td><td>On</td><td>RAW</td><td>Refresh Fate to threshold at session start.</td></tr><tr><td>Allow Player XP Edit</td><td>Off</td><td>Policy</td><td>Let players edit their own XP.</td></tr><tr><td>Starting XP</td><td>1000</td><td>RAW</td><td>XP for new characters.</td></tr><tr><td>Char Gen Method</td><td>Rolled</td><td>RAW</td><td>Rolled, Rolled 25, or Point Buy.</td></tr><tr><td>Wounds Rerolls</td><td>1</td><td>House</td><td>Rerolls on starting wounds roll.</td></tr><tr><td>Divination Rerolls</td><td>0</td><td>RAW</td><td>Rerolls on Emperor's Divination.</td></tr><tr><td>Automate Phenomena</td><td>On</td><td>RAW</td><td>Auto-roll on psychic phenomena table.</td></tr><tr><td>Automate Corruption</td><td>On</td><td>RAW</td><td>Auto-apply corruption thresholds.</td></tr><tr><td>Automate Insanity</td><td>On</td><td>RAW</td><td>Auto-apply insanity thresholds.</td></tr><tr><td>Warband Inventory Access</td><td>All</td><td>Policy</td><td>Who sees the shared stash.</td></tr><tr><td>Block Untrained Skills</td><td>Off</td><td>Optional RAW</td><td>Strictly enforce untrained skill blocks.</td></tr><tr><td>Require Elite Approval</td><td>On</td><td>Policy</td><td>GM must approve elite advance purchases.</td></tr><tr><td>Allow Rule Editing</td><td>On</td><td>Policy</td><td>Access to YAML rule element editor.</td></tr><tr><td>Grant Starting Thrones</td><td>On</td><td>RAW</td><td>Auto-grant currency at creation.</td></tr><tr><td>Starting Thrones</td><td>50</td><td>Varies</td><td>Amount of starting Throne Gelt.</td></tr></tbody></table><h3>Combat (World / GM Only)</h3><table><thead><tr><th>Setting</th><th>Default</th><th>Description</th></tr></thead><tbody><tr><td>XP Multiplier</td><td>100%</td><td>Scales all XP awards. 100% = RAW.</td></tr><tr><td>Critical Wounds Table</td><td>On</td><td>Auto-roll critical damage tables.</td></tr></tbody></table><h3>Display (Client / Per-Player)</h3><table><thead><tr><th>Setting</th><th>Default</th><th>Description</th></tr></thead><tbody><tr><td>Show Modifier Breakdown</td><td>On</td><td>Full modifier breakdown in roll tooltips.</td></tr><tr><td>Compact NPC Sheet</td><td>Off</td><td>Force NPC sheets to compact mode.</td></tr><tr><td>NPC Default Compact</td><td>Off</td><td>New NPCs open in compact view.</td></tr><tr><td>Invert Shift+Roll</td><td>Off</td><td>Swap click (roll) and Shift+click (dialog).</td></tr><tr><td>Wizard Scale</td><td>100%</td><td>UI scale for character creation (75–200%).</td></tr><tr><td>Sheet Scale</td><td>100%</td><td>UI scale for all sheets (75–200%).</td></tr><tr><td>Enable Animations</td><td>On</td><td>UI transition animations.</td></tr><tr><td>Enable Sounds</td><td>On</td><td>System sound effects.</td></tr><tr><td>Default View Mode</td><td>Full</td><td>Sheet view: Full, Compact, or Combat.</td></tr><tr><td>Enable VFX</td><td>On</td><td>Token visual effects.</td></tr><tr><td>VFX Intensity</td><td>Normal</td><td>Minimal / Normal / Full.</td></tr><tr><td>Enable Combat HUD</td><td>On</td><td>Bottom-screen combat panel.</td></tr><tr><td>Combat HUD Position</td><td>Bottom Left</td><td>Bottom-left or bottom-centre.</td></tr></tbody></table><h3>Module Integrations</h3><table><thead><tr><th>Setting</th><th>Default</th><th>Scope</th><th>Description</th></tr></thead><tbody><tr><td>Enable DSN</td><td>On</td><td>Client</td><td>Dice So Nice 3D dice.</td></tr><tr><td>Enable Ruler Overlay</td><td>On</td><td>Client</td><td>Range overlay on ruler.</td></tr><tr><td>Enable TMFX</td><td>On</td><td>World</td><td>Token Magic FX.</td></tr><tr><td>Enable FX Master</td><td>On</td><td>World</td><td>FX Master weather/particles.</td></tr><tr><td>Deadline Notifications</td><td>On</td><td>World</td><td>Calendar deadline alerts.</td></tr></tbody></table><h3>Loot &amp; Salvage (World / GM Only)</h3><table><thead><tr><th>Setting</th><th>Default</th><th>Description</th></tr></thead><tbody><tr><td>Killing Blow Degradation</td><td>On</td><td>Equipment degrades based on kill DoS.</td></tr><tr><td>Player Looting</td><td>Off</td><td>Allow players to open loot dialogs.</td></tr><tr><td>Default Salvage Skill</td><td>Awareness</td><td>Default skill for loot container searches.</td></tr><tr><td>Auto-Reveal Surface Items</td><td>On</td><td>Show DoS 0 items even on failed checks.</td></tr></tbody></table>",
                    "format": 1
                },
                "sort": 1500000
            },
            {
                "name": "Keyboard Shortcuts & Tips",
                "type": "text",
                "text": {
                    "content": "<h2>Keyboard Shortcuts &amp; Tips</h2><h3>Keyboard Shortcuts</h3><table><thead><tr><th>Shortcut</th><th>Action</th><th>Scope</th></tr></thead><tbody><tr><td><kbd>Ctrl+Space</kbd></td><td>Quick Search (command palette)</td><td>All users</td></tr><tr><td><kbd>Ctrl+B</kbd></td><td>Compendium Browser</td><td>All users</td></tr><tr><td><kbd>Shift+A</kbd></td><td>Actions Grid</td><td>All users</td></tr><tr><td><kbd>W</kbd></td><td>Toggle Warband Sheet</td><td>All users</td></tr><tr><td><kbd>Shift+Click</kbd></td><td>Skip roll dialog (or show it, if inverted)</td><td>All users</td></tr></tbody></table><h3>API Quick Reference (Console)</h3><table><thead><tr><th>Command</th><th>Action</th></tr></thead><tbody><tr><td><code>game.dh2e.awardXP()</code></td><td>Open XP award dialog (GM)</td></tr><tr><td><code>game.dh2e.requestRoll()</code></td><td>Request a roll from players (GM)</td></tr><tr><td><code>game.dh2e.grantAdvance()</code></td><td>GM Grant advance to player</td></tr><tr><td><code>game.dh2e.requisition()</code></td><td>Open requisition dialog</td></tr><tr><td><code>game.dh2e.voxTerminal()</code></td><td>Open Vox Compose (GM)</td></tr><tr><td><code>game.dh2e.actionsGrid()</code></td><td>Open Actions Grid</td></tr><tr><td><code>game.dh2e.quickSearch()</code></td><td>Open Quick Search</td></tr><tr><td><code>game.dh2e.createSupplyCache(\"name\")</code></td><td>Create a loot supply cache (GM)</td></tr><tr><td><code>game.dh2e.createHomebrewItem(\"type\", \"name\")</code></td><td>Create a homebrew item (GM)</td></tr><tr><td><code>game.dh2e.copyToHomebrew(uuid)</code></td><td>Copy item to homebrew (GM)</td></tr><tr><td><code>game.dh2e.lootCorpse(npc)</code></td><td>Open corpse loot dialog (GM)</td></tr><tr><td><code>game.dh2e.maintainCybernetics(actor)</code></td><td>Maintain cybernetics macro</td></tr><tr><td><code>game.dh2e.weatherPresets()</code></td><td>FX Master weather menu (GM)</td></tr></tbody></table><h3>GM Tips</h3><ul><li><strong>Drag &amp; Drop Everything</strong> — Compendium items, browser results, and quick search results are all draggable to actor sheets and the macro bar.</li><li><strong>Right-Click for Context</strong> — Right-click tokens, actor sidebar entries, and compendium browser results for contextual actions (loot, copy to homebrew, etc.).</li><li><strong>Homebrew Visibility</strong> — Use private homebrew items as GM-only reference (stat blocks for items players haven't discovered yet). Toggle to public when revealed.</li><li><strong>Supply Caches</strong> — Pre-build loot containers for dungeons/locations. Set DoS requirements to reward thorough searching.</li><li><strong>Vox for Atmosphere</strong> — Use the Vox Terminal to deliver mission briefings, distress calls, and sector reports. Send full journal pages for rich formatted content.</li><li><strong>Rule Elements</strong> — Custom weapons and talents can have YAML Rule Elements that automatically apply modifiers, dice overrides, and conditions. Edit them on the item sheet (if <em>Allow Rule Editing</em> is on).</li><li><strong>NPC Sheets</strong> — Toggle between full sheet mode (for editing) and compact stat block mode (for quick reference in combat). The <em>NPC Default Compact</em> setting controls which opens first.</li></ul><h3>Player Tips</h3><ul><li><strong>Favourite Your Go-To Items</strong> — Star your primary weapon, frequently used skills, and key items. They'll populate your Combat HUD hotbar automatically.</li><li><strong>Use Quick Search</strong> — <kbd>Ctrl+Space</kbd> is the fastest way to find anything. Type a few letters and hit Enter.</li><li><strong>Check Your Ammo</strong> — The weapon tray colour-codes your ammo. Green is good, orange is getting low, red means reload.</li><li><strong>Fate Points</strong> — Right-click a chat card after a bad roll to spend Fate. You can reroll, add +10, or halve damage. Burning Fate (permanent) can save your life.</li><li><strong>Vox Log</strong> — Check your character's Vox Log tab for past transmissions. You can convert mission briefings to personal objectives.</li></ul>",
                    "format": 1
                },
                "sort": 1600000
            }
        ]
    }
]
